Ortho_App/data/Master_cfd_file_laminar/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

#include "pvfr.txt"

boundaryField
{
    inlet
    {
        type          pressureInletOutletVelocity;
        value         uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }

    outlet
    {
        type            flowRateOutletVelocity;
        massFlowRate    constant #codeStream
        {
            code
            #{
               scalar result = ($vfr * 1.122) / 60000;
               os  << result;
            #};
        };
        rhoOutlet       1.122;
    }
}

// ************************************************************************* //
