Ortho_App/data/Master_cfd_file_laminar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "bb_min_max.txt"

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      1; // It will keep the last xx saved solutions

writeFormat     binary;

writePrecision  6; // It will save the solution in ascii format (writeFormat) with a precision of 8 digits (writePrecision)

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true; // And as the option runTimeModifiable is on (true), we can modify all these entries while we are running the simulation.

functions
{
    #includeFunc "residuals"

    avgsurf1
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        surfaceFormat   vtk;
        writeArea       false;
        regionType      sampledSurface;
        name            avg1;
        sampledSurfaceDict
           {
              type        plane;
              point       (0 $IN_PLANE_Y4 0); //in
              normal      (0 1 0);
           }
        operation       areaAverage;
        postOperation   none; //mag;
        fields
        (
	      p
	      U
        );
    }

    avgsurf2
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        surfaceFormat   vtk;
        writeArea       false;
        regionType      sampledSurface;
        name            avg2;
        sampledSurfaceDict
           {
              type        plane;
              point       (0 $IN_PLANE_Y3 0); //in
              normal      (0 1 0);
           }
        operation       areaAverage;
        postOperation   none; //mag;
        fields
        (
	      p
	      U
        );
    }

    avgsurf3
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg3;
        sampledSurfaceDict
        {
            type        plane;
            point       (0 $IN_PLANE_Y2 0); //in
            normal      (0 1 0);
        }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf4
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg4;
        sampledSurfaceDict
        {
            type        plane;
            point       (0 $IN_PLANE_Y1 0); //in
            normal      (0 1 0);
        }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf5
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg5;
        sampledSurfaceDict
        {
            type        plane;
            point       (0 $IN_PLANE_Y0 0); //in
            normal      (0 1 0);
        }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf6
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg6;
        sampledSurfaceDict
           {
              type       plane;
              point     (0 0 $OUT_PLANE_Z0);
              normal    (0 0 1);
           }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf7
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg7;
        sampledSurfaceDict
           {
              type       plane;
              point     (0 0 $OUT_PLANE_Z1);
              normal    (0 0 1);
           }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf8
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg8;
        sampledSurfaceDict
           {
              type       plane;
              point     (0 0 $OUT_PLANE_Z2);
              normal    (0 0 1);
           }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf9
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg9;
        sampledSurfaceDict
           {
              type       plane;
              point     (0 0 $OUT_PLANE_Z3);
              normal    (0 0 1);
           }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf10
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg10;
        sampledSurfaceDict
           {
              type       plane;
              point     (0 0 $OUT_PLANE_Z4);
              normal    (0 0 1);
           }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    avgsurf11
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        log             on;
        enabled         true;
        writeControl    timeStep;
        writeInterval   10; //100;
        writeFields     false;
        writeArea       false;
        surfaceFormat   vtk;
        regionType      sampledSurface;
        name            avg11;
        sampledSurfaceDict
           {
              type       plane;
              point     (0 0 $OUT_PLANE_Z5);
              normal    (0 0 1);
           }
        operation       areaAverage;
        postOperation   none;
        fields
        (
	      p
	      U
        );
    }

    probes
    {
    type    probes;
    libs    (sampling);
    name    probes;
    writeControl   timeStep;
    writeInterval  10;
    fields
    (
        p
        U
    );
    probeLocations
    (
        #include "face_centers.txt"
    );
    }
}

// ************************************************************************* //
